Jwood1126-coder/Project-Grasshopper/firmware/sdkconfig.defaults
# Grasshopper — ESP-IDF defaults. menuconfig changes go here so they
# survive a clean build.

# Target
CONFIG_IDF_TARGET="esp32s3"
CONFIG_IDF_TARGET_ESP32S3=y

# Flash & PSRAM (ESP32-S3 WROOM N8R8 / GOOUUU clone — 8 MB flash, 8 MB OPI PSRAM)
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# Partition table (see partitions.csv)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# Console: native USB CDC. If the GOOUUU board doesn't enumerate, fall
# back to UART by setting CONFIG_ESP_CONSOLE_UART_DEFAULT=y in a build
# override.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG_ENABLED=y

# Main task: needs room for setup + JSON serializers
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Wi-Fi: small static buffers, mostly dynamic so PSRAM does the work
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=4
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=16

# TLS: use the bundled cert chain so wss:// works without provisioning
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_INFO=y

# Bootloader / image
CONFIG_BOOTLOADER_LOG_LEVEL_INFO=y
CONFIG_COMPILER_OPTIMIZATION_DEFAULT=y
